Repository: dlundquist/neutron
Catalog: neutron/locale/*/LC_MESSAGES/neutron-log-error.po
Languages: fr, ja

source: Original exception being dropped: %s
fr: Exception d'origine en cours de suppression : %s
ja: 除去される元の例外: %s

source: Unexpected exception occurred %d time(s)... retrying.
fr: Exception inattendue survenue %d fois... Nouvel essai.
ja: 予期せぬ例外が、%d回()発生しました。再試行中。

source: Exception during rpc cleanup.
fr: Exception pendant le nettoyage rpc.
ja: RPCクリーンアップ中に例外が発生

source: Unhandled exception
fr: Exception non gérée
ja: 未処理例外

source: DB exceeded retry limit.
fr: DB dépassé limite de tentatives
ja: DBへのリトライが上限に達しました。

source: DB connection error.
fr: erreurs de connexion DB
ja: DB接続エラーが発生しました。

source: DB exception wrapped.
fr: Exception BD encapsulée.
ja: DB 例外がラップされました。

source: Exception during message handling
fr: Exception pendant le traitement des messages
ja: メッセージ処理中の例外

source: Exception in string format operation
fr: Exception dans l'opération de format de chaîne
ja: ストリング・フォーマットの操作で例外が発生しました

source: Returning exception %s to caller
fr: Renvoi de l'exception %s à l'appelant
ja: 例外 %s を呼び出し元に返しています

source: Failed to process message ... skipping it.
fr: Echec de traitement du message... Message ignoré.
ja: メッセージの処理に失敗しました... スキップしています。

source: Failed to process message ... will requeue.
fr: Échec de traitement du message... Message remis en file d'attente.
ja: メッセージ処理が失敗しました…キューに再登録します。

source: AMQP server on %(hostname)s:%(port)d is unreachable: %(err_str)s. Trying again in %(sleep_time)d seconds.
fr: Le serveur AMQP sur %(hostname)s:%(port)d est inaccessible : %(err_str)s. Nouvelle tentative dans %(sleep_time)d secondes.
ja: %(hostname)s:%(port)d 上の AMQP サーバーは到達不能です: %(err_str)s。%(sleep_time)d 秒後に再試行します。

source: Failed to declare consumer for topic '%(topic)s': %(err_str)s
fr: Echec de la déclaration du consommateur pour la rubrique '%(topic)s' : %(err_str)s
ja: トピック '%(topic)s' のコンシューマーを宣言できませんでした: %(err_str)s

source: Failed to consume message from queue: %s
fr: Echec de la consommation du message depuis la file d'attente : %s
ja: キューからのメッセージのコンシュームに失敗しました: %s

source: Failed to publish message to topic '%(topic)s': %(err_str)s
fr: Echec de la publication du message dans la rubrique '%(topic)s' : %(err_str)s
ja: トピック '%(topic)s' に対してメッセージをパブリッシュできませんでした: %(err_str)s

source: Failed to process message... skipping it.
fr: Echec du traitement du message... Message ignoré.
ja: メッセージの処理に失敗しました... スキップしています。

source: Unable to connect to AMQP server: %(e)s. Sleeping %(delay)s seconds
fr: Impossible de se connecter au serveur AMQP : %(e)s. En veille pendant %(delay)s secondes
ja: AMQP サーバーに接続できません: %(e)s。%(delay)s 秒間スリープ状態になります

source: Error processing message. Skipping it.
fr: Erreur lors du traitement du message. Message ignoré.
ja: メッセージの処理中にエラーが発生しました。スキップしています。

source: JSON serialization failed.
fr: Echec de la sérialisation JSON.
ja: JSON の直列化が失敗しました。

source: ZeroMQ socket could not be closed.
ja: ZeroMQソケットをクローズできませんでした。

source: RPC message did not include method.
fr: Le message d'appel de procédure distante n'a pas inclus la méthode.
ja: RPC メッセージにメソッドが含まれていませんでした。

source: Topic socket file creation failed.
fr: La création du fichier socket de la rubrique a échoué.
ja: トピック・ソケット・ファイルの作成に失敗しました。

source: Local per-topic backlog buffer full for topic %(topic)s. Dropping message.
fr: Mémoire tampon de commandes en attente par rubrique locale saturée pour la rubrique %(topic)s. Suppression du message.
ja: トピック %(topic)s のトピック単位のローカル・バックログ・バッファーがフルです。メッセージを除去しています。

source: Required IPC directory does not exist at %s
fr: Répertoire IPC requis n'existe pas à %s
ja: 必要な IPC ディレクトリが %s に存在しません

source: Permission denied to IPC directory at %s
fr: Permission refusée au répertoire IPC à %s
ja: IPC ディレクトリ %s へのアクセス許可がありません

source: Could not create ZeroMQ receiver daemon. Socket may already be in use.
fr: Impossible de créer le démon récepteur ZeroMQ. Le socket est sans doute déjà en cours d'utilisation.
ja: ZeroMQ 受信側デーモンを作成できませんでした。ソケットが既に使用中である可能性があります。

source: ZMQ Envelope version unsupported or unknown.
fr: Version de l'enveloppe ZMQ non prise en charge ou inconnue.
ja: ZMQ エンベロープのバージョンがサポートされないか、不明です。
